% ============= memo =====================
% for 変数 = 開始値 : 増分 : 終了値
    % 繰り返したい処理
% end

for i = 1:2:7
    disp(i)
end

% i = 1, 3, 5, 7
% ========================================

% ============= memo =====================
A = [1, 2, 3; 4, 5, 6; 7, 8, 9];
% 1 2 3
% 4 5 6
% 7 8 9
% の2次元配列初期化できる
% ========================================

% ============= memo =====================
% 行列関連の使える関数
% 桁数注意 TODO
% 1-norm
fprintf("1-norm = %.4e\n", norm(A, 1));
% 2-norm
fprintf("2-norm = %.4e\n", norm(A, 2));
% inf-norm
fprintf("inf-norm = %.4e\n", norm(A, inf));
% ========================================
